<?php

//=============================
//地震状態記録ファイル「Jishin_joutai.txt」を初期化するためのphp。
//このファイルを起動することで初期化される。
//=============================
//=============================
//フラグファイル読み出し
// 状態フラグ $joutai
//    [0]quake:地震が起こった
//=============================
    $joutai_txt = file_get_contents("Jishin_joutai.txt");
    if($joutai_txt !== ""){
        $joutai = unserialize($joutai_txt);
    }

//=============================
//フラグ設定
//=============================
$joutai[0] = FALSE;

//=============================
//フラグファイル格納。
//=============================
    $response = file_put_contents("Jishin_joutai.txt" , serialize($joutai));

?>